DataProcessors/ЗаполниеТестовойНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗаполниеТестовойНоменклатуры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>шт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>кг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>л</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>м</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаполниеТестовойНоменклатуры/Ext/ObjectModule.bsl
Процедура ЗаполнитьДанные() Экспорт
	ОчиститьДанные();
	СоздатьГруппы();
	СоздатьТовары();
	СообщитьОбУспехе();
КонецПроцедуры

Процедура ОчиститьДанные()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.Предопределенный
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
	

	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
		Объект = ВыборкаДетальныхЗаписей.Ссылка.ПолучитьОбъект();
		Попытка
			Объект.Удалить();
		Исключение
			Объект.ПометкаНаУдаления(Истина);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры



Процедура СоздатьГруппы()
	НазванияГрупп = Новый Массив;
	НазванияГрупп.Добавить("Электроника");
	НазванияГрупп.Добавить("Одежда");
	НазванияГрупп.Добавить("Продукты");
	НазванияГрупп.Добавить("Мебель");
	НазванияГрупп.Добавить("Книги");
	НазванияГрупп.Добавить("Спорт");
	НазванияГрупп.Добавить("Игрушки");
	
	Для Инд = 0 По НазванияГрупп.ВГраница() Цикл
		НовыйОбъект = Справочники.Номенклатура.СоздатьГруппу();
		НовыйОбъект.Наименование = НазванияГрупп[Инд];
		НовыйОбъект.Код = Формат(Инд + 1, "ЧЦ=5; ЧВН=; ЧГ=");
		Попытка
			НовыйОбъект.Записать();
		Исключение
			Сообщить("Ошибка создания группы " + НазванияГрупп[Инд] + ": " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьТовары()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ИСТИНА
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаГрупп = РезультатЗапроса.Выбрать();
	
	МассивГрупп = Новый Массив;
	Пока ВыборкаГрупп.Следующий() Цикл
		МассивГрупп.Добавить(ВыборкаГрупп.Ссылка);
	КонецЦикла;
	
	Если МассивГрупп.Количество() = 0 Тогда
		Сообщить("Не найдено групп номенклатуры!");
		Возврат;
	КонецЕсли;
	
	ЕдиницыИзмерения = Новый Массив;
	ЕдиницыИзмерения.Добавить(Перечисления.ЕдиницыИзмерения.шт);
	ЕдиницыИзмерения.Добавить(Перечисления.ЕдиницыИзмерения.кг);
	ЕдиницыИзмерения.Добавить(Перечисления.ЕдиницыИзмерения.л);
	ЕдиницыИзмерения.Добавить(Перечисления.ЕдиницыИзмерения.м);
	
	СтавкиНДС = Новый Массив;
	СтавкиНДС.Добавить(Перечисления.СтавкиНДС.БезНДС);
	СтавкиНДС.Добавить(Перечисления.СтавкиНДС.НДС20);
	СтавкиНДС.Добавить(Перечисления.СтавкиНДС.НДС7);
	СтавкиНДС.Добавить(Перечисления.СтавкиНДС.НДС0);
	
	НалоговыеГруппы = ПолучитьНалоговыеГруппы();
	
	Для НомерТовара = 1 По 200 Цикл
		НовыйОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		НовыйОбъект.Родитель = МассивГрупп[(НомерТовара - 1) % МассивГрупп.Количество()];
		НовыйОбъект.Наименование = СформироватьНазваниеТовара(НомерТовара);
		НовыйОбъект.Код = Формат(300 + НомерТовара, "ЧЦ=5; ЧВН=; ЧГ=");
		НовыйОбъект.Артикул = "ART" + Формат(НомерТовара, "ЧЦ=6; ЧВН=; ЧГ=0");
		НовыйОбъект.ЕдиницаИзмерения = ЕдиницыИзмерения[(НомерТовара - 1) % ЕдиницыИзмерения.Количество()];
		НовыйОбъект.СтавкаНДС = СтавкиНДС[(НомерТовара - 1) % СтавкиНДС.Количество()];
		
		Если НалоговыеГруппы.Количество() > 0 Тогда
			НовыйОбъект.НалоговаяГруппа = НалоговыеГруппы[(НомерТовара - 1) % НалоговыеГруппы.Количество()];
		КонецЕсли;
		
		НовыйОбъект.КодУКТЗЕД = Формат(1234567890 + НомерТовара, "ЧЦ=10; ЧВН=; ЧГ=");
		НовыйОбъект.ТребуетАкцизнуюМарку = (НомерТовара % 10 = 0);
		НовыйОбъект.ПроцентНаценки = 10 + (НомерТовара % 50);
		
		Попытка
			НовыйОбъект.Записать();
		Исключение
			Сообщить("Ошибка создания товара №" + НомерТовара + ": " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьНалоговыеГруппы()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НалоговыеГруппы.Ссылка
	|ИЗ
	|	Справочник.НалоговыеГруппы КАК НалоговыеГруппы
	|ГДЕ
	|	НЕ НалоговыеГруппы.ПометкаУдаления
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаГрупп = РезультатЗапроса.Выбрать();
	
	МассивГрупп = Новый Массив;
	Пока ВыборкаГрупп.Следующий() Цикл
		МассивГрупп.Добавить(ВыборкаГрупп.Ссылка);
	КонецЦикла;
	
	Возврат МассивГрупп;
КонецФункции

Функция СформироватьНазваниеТовара(НомерТовара)
	ТипыТоваров = Новый Массив;
	ТипыТоваров.Добавить("Товар");
	ТипыТоваров.Добавить("Изделие");
	ТипыТоваров.Добавить("Продукт");
	ТипыТоваров.Добавить("Устройство");
	ТипыТоваров.Добавить("Компонент");
	
	НазванияТоваров = Новый Массив;
	НазванияТоваров.Добавить("Стандартный");
	НазванияТоваров.Добавить("Премиум");
	НазванияТоваров.Добавить("Эконом");
	НазванияТоваров.Добавить("Профессиональный");
	НазванияТоваров.Добавить("Универсальный");
	
	ТипТовара = ТипыТоваров[(НомерТовара - 1) % ТипыТоваров.Количество()];
	НазваниеТовара = НазванияТоваров[(НомерТовара - 1) % НазванияТоваров.Количество()];
	
	Возврат ТипТовара + " " + НазваниеТовара + " №" + Формат(НомерТовара, "ЧЦ=3; ЧВН=; ЧГ=0");
КонецФункции

Процедура СообщитьОбУспехе()
	Сообщить("Номенклатура успешно заполнена! Создано: 7 групп, 200 товаров.");
КонецПроцедуры
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
КонецПроцедуры
